from pandas import DataFrame

# 딕셔너리를 원소로 갖는 리스트
grade_data = [{'국어':98, '영어':None, '수학':88, '과학':64}, 
              {'국어':88, '영어':90, '수학':62, '과학':72}, 
              {'국어':92, '영어':70, '수학':None, '과학':None}, 
              {'국어':63, '영어':60, '수학':31, '과학':70}, 
              {'국어':120, '영어':50, '수학':None, '과학':88}]

df = DataFrame(grade_data, index=['철수','영희','민철','수현','호영'])
print(df)
print('-' *20)

# 1) 인덱싱 1
# => 열 -> 행 순으로 접근하기 (읽기전용)
print(df['국어']['철수'])
print('-'*40)

# 2) 인덱싱 2
#=> 행 -> 열 순으로 접근하기 (읽기, 쓰기 권장)
print(df.loc['철수', '국어'])
print('-'*40)

# 3) 데이터 수정하기
'''     # 경고 발생
df['국어']['철수'] = 85
print(df)
print('-'*40)                       '''

df.loc['철수', '국어'] = 75
print(df)
print('-'*40)








